app/controllers/stories_controller.rb

SELECT "stories".* FROM "stories"
---
    def index
        render json: Story.all