app/controllers/users_controller.rb

    def create
        user = User.create!(u_params)
---
INSERT INTO "users" ("username", "password_digest", "name", "image_url", "left_off", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"