app/controllers/userchoices_controller.rb

SELECT "userchoices".* FROM "userchoices" WHERE "userchoices"."user_id" = $1  [["user_id", 1]]
---
    def index
        render json: Userchoice.all

SELECT "choices".* FROM "choices" WHERE "choices"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "userchoices".* FROM "userchoices" WHERE "userchoices"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        userchoice = Userchoice.find(params[:id])